// 6*. Пользователь, с помощью команды prompt, вводит номер билета - 6 цифр. Программа определяет является
// ли счастливым данный билетик и выводит соответстующее сообщение в консоль. Счастливый билет - билет,
// у которого сумма первых трех цифр равна сумме последних трех цифр номера билета.
// Для выполнения задания необходимо использовать оператор % и ветвление.
// Чтобы сравнить два значения, можно использовать if и else (курс основ программирования), например:
// "use strict";
"use strict";
let numBilet;

numBilet = prompt('Введите шестизначный номер билета чтобы проверить счастливый ли он: ');
if ((numBilet <= 999999) & (numBilet >= 100000)) {
    alert(numBilet);
} else {
    alert('Не верно, введите шестизначное число. ');
}

if (numBilet % 2) {

}
